; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v1)
             (pred_2 ?v9 ?v6)
             (pred_7 ?v10 ?v6)
             (pred_6 ?v5 ?v10 )
	     (pred_3 ?v10)
             (pred_4 ?v11)
             (pred_9 ?v9)
             (pred_11 ?v6)
             (pred_5 ?v10)
             (pred_1 ?v9)
             (pred_12 ?v10)
             (pred_8 ))



(:action op_2
:parameters (?v13 ?v7 ?v4 ?v12)
:precondition (and (pred_4 ?v13) (pred_4 ?v7) (pred_9 ?v4) (pred_11 ?v12)
          (pred_10 ?v13 ?v7) (pred_2 ?v4 ?v12)
                   (pred_7 ?v7 ?v12) (pred_3 ?v13) 
                   (pred_5 ?v7) (pred_1 ?v4))
:effect (and  (pred_12 ?v7) (not (pred_5 ?v7))))


(:action op_4
:parameters (?v13 ?v3)
:precondition (and (pred_4 ?v13) (pred_4 ?v3)
               (pred_3 ?v13) (pred_10 ?v13 ?v3) (pred_12 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v13))))

(:action op_1
:parameters (?v13 ?v4)
:precondition (and (pred_4 ?v13) (pred_9 ?v4) 
                  (pred_3 ?v13) (pred_6 ?v4 ?v13) (pred_8 ))
:effect (and (pred_1 ?v4)
   (not (pred_6 ?v4 ?v13)) (not (pred_8 ))))


(:action op_5
:parameters (?v13 ?v2 ?v8)
:precondition (and (pred_4 ?v13) (pred_9 ?v2) (pred_9 ?v8)
                  (pred_3 ?v13) (pred_1 ?v8) (pred_6 ?v2 ?v13))
:effect (and (pred_1 ?v2) (pred_6 ?v8 ?v13)
        (not (pred_1 ?v8)) (not (pred_6 ?v2 ?v13))))

(:action op_3
:parameters (?v13 ?v4)
:precondition (and (pred_4 ?v13) (pred_9 ?v4) 
                  (pred_3 ?v13) (pred_1 ?v4))
:effect (and (pred_8 ) (pred_6 ?v4 ?v13) (not (pred_1 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_32 obj_07 obj_24 obj_16 obj_30 obj_19 obj_18 obj_04 obj_06 obj_14 obj_08 obj_22 obj_23 obj_26 obj_31 obj_20 obj_27 obj_01 obj_29 obj_10 obj_21 obj_03 obj_17 obj_12 obj_09
    obj_05 obj_13 obj_11
    obj_28 obj_25 obj_02 obj_15
    )

    (:init
       (pred_8)

       (pred_4 obj_32)
       (pred_4 obj_07)
       (pred_4 obj_24)
       (pred_4 obj_16)
       (pred_4 obj_30)
       (pred_4 obj_19)
       (pred_4 obj_18)
       (pred_4 obj_04)
       (pred_4 obj_06)
       (pred_4 obj_14)
       (pred_4 obj_08)
       (pred_4 obj_22)
       (pred_4 obj_23)
       (pred_4 obj_26)
       (pred_4 obj_31)
       (pred_4 obj_20)
       (pred_4 obj_27)
       (pred_4 obj_01)
       (pred_4 obj_29)
       (pred_4 obj_10)
       (pred_4 obj_21)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_09)
       (pred_11 obj_05)
       (pred_11 obj_13)
       (pred_11 obj_11)
       (pred_9 obj_28)
       (pred_9 obj_25)
       (pred_9 obj_02)
       (pred_9 obj_15)

       (pred_10 obj_32 obj_19)
       (pred_10 obj_32 obj_07)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_07 obj_24)
       (pred_10 obj_07 obj_32)
       (pred_10 obj_24 obj_04)
       (pred_10 obj_24 obj_16)
       (pred_10 obj_24 obj_07)
       (pred_10 obj_16 obj_06)
       (pred_10 obj_16 obj_30)
       (pred_10 obj_16 obj_24)
       (pred_10 obj_30 obj_14)
       (pred_10 obj_30 obj_16)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_18)
       (pred_10 obj_19 obj_32)
       (pred_10 obj_18 obj_22)
       (pred_10 obj_18 obj_04)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_04 obj_23)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_04 obj_24)
       (pred_10 obj_04 obj_18)
       (pred_10 obj_06 obj_26)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_06 obj_16)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_14 obj_31)
       (pred_10 obj_14 obj_30)
       (pred_10 obj_14 obj_06)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_22 obj_27)
       (pred_10 obj_22 obj_23)
       (pred_10 obj_22 obj_18)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_23 obj_01)
       (pred_10 obj_23 obj_26)
       (pred_10 obj_23 obj_04)
       (pred_10 obj_23 obj_22)
       (pred_10 obj_26 obj_29)
       (pred_10 obj_26 obj_31)
       (pred_10 obj_26 obj_06)
       (pred_10 obj_26 obj_23)
       (pred_10 obj_31 obj_10)
       (pred_10 obj_31 obj_14)
       (pred_10 obj_31 obj_26)
       (pred_10 obj_20 obj_21)
       (pred_10 obj_20 obj_27)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_27 obj_03)
       (pred_10 obj_27 obj_01)
       (pred_10 obj_27 obj_22)
       (pred_10 obj_27 obj_20)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_01 obj_29)
       (pred_10 obj_01 obj_23)
       (pred_10 obj_01 obj_27)
       (pred_10 obj_29 obj_12)
       (pred_10 obj_29 obj_10)
       (pred_10 obj_29 obj_26)
       (pred_10 obj_29 obj_01)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_31)
       (pred_10 obj_10 obj_29)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_21 obj_20)
       (pred_10 obj_03 obj_17)
       (pred_10 obj_03 obj_27)
       (pred_10 obj_03 obj_21)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_29)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_12)
       (pred_5 obj_26)
       (pred_5 obj_09)
       (pred_5 obj_10)
       (pred_5 obj_19)
       (pred_7  obj_26 obj_05)
       (pred_7  obj_09 obj_13)
       (pred_7  obj_10 obj_11)
       (pred_7  obj_19 obj_13)
       (pred_12 obj_32)
       (pred_12 obj_07)
       (pred_12 obj_24)
       (pred_12 obj_16)
       (pred_12 obj_30)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_12 obj_08)
       (pred_12 obj_22)
       (pred_12 obj_23)
       (pred_12 obj_31)
       (pred_12 obj_20)
       (pred_12 obj_27)
       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_21)
       (pred_12 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_12)

       (pred_2  obj_28 obj_05)
       (pred_2  obj_25 obj_13)
       (pred_2  obj_02 obj_11)
       (pred_2  obj_15 obj_13)
       (pred_6 obj_28 obj_04)
       (pred_6 obj_25 obj_17)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_15 obj_16)
       (pred_3 obj_07)
    )

    (:goal (and
       (pred_6 obj_28 obj_32)
       (pred_6 obj_25 obj_31)
       (pred_6 obj_15 obj_09)
    ))
(:constraints
  (always (not (pred_3 obj_24)))
)
)

; plan
1. (op_4 obj_07 obj_18)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_18)
   goals met: 0 of 3
2. (op_4 obj_18 obj_22)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_22)
   goals met: 0 of 3
3. (op_4 obj_22 obj_23)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_23)
   goals met: 0 of 3
4. (op_4 obj_23 obj_01)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_01)
   goals met: 0 of 3
5. (op_4 obj_01 obj_17)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_17)
   goals met: 0 of 3
6. (op_1 obj_17 obj_25)
   deleted: (pred_6 obj_25 obj_17) (pred_8)
   added: (pred_1 obj_25)
   goals met: 0 of 3
7. (op_4 obj_17 obj_12)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_12)
   goals met: 0 of 3
8. (op_2 obj_12 obj_09 obj_25 obj_13)
   deleted: (pred_5 obj_09)
   added: (pred_12 obj_09)
   goals met: 0 of 3
9. (op_4 obj_12 obj_29)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_29)
   goals met: 0 of 3
10. (op_4 obj_29 obj_01)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_01)
   goals met: 0 of 3
11. (op_4 obj_01 obj_23)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_23)
   goals met: 0 of 3
12. (op_4 obj_23 obj_04)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_04)
   goals met: 0 of 3
13. (op_5 obj_04 obj_28 obj_25)
   deleted: (pred_1 obj_25) (pred_6 obj_28 obj_04)
   added: (pred_1 obj_28) (pred_6 obj_25 obj_04)
   goals met: 0 of 3
14. (op_4 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 0 of 3
15. (op_2 obj_06 obj_26 obj_28 obj_05)
   deleted: (pred_5 obj_26)
   added: (pred_12 obj_26)
   goals met: 0 of 3
16. (op_3 obj_06 obj_28)
   deleted: (pred_1 obj_28)
   added: (pred_8) (pred_6 obj_28 obj_06)
   goals met: 0 of 3
17. (op_4 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 0 of 3
18. (op_1 obj_04 obj_25)
   deleted: (pred_6 obj_25 obj_04) (pred_8)
   added: (pred_1 obj_25)
   goals met: 0 of 3
19. (op_4 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 0 of 3
20. (op_4 obj_06 obj_26)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_26)
   goals met: 0 of 3
21. (op_4 obj_26 obj_31)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_31)
   goals met: 0 of 3
22. (op_3 obj_31 obj_25)
   deleted: (pred_1 obj_25)
   added: (pred_8) (pred_6 obj_25 obj_31)
   goals met: 1 of 3
23. (op_4 obj_31 obj_26)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_26)
   goals met: 1 of 3
24. (op_4 obj_26 obj_06)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_06)
   goals met: 1 of 3
25. (op_4 obj_06 obj_16)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_16)
   goals met: 1 of 3
26. (op_1 obj_16 obj_15)
   deleted: (pred_6 obj_15 obj_16) (pred_8)
   added: (pred_1 obj_15)
   goals met: 1 of 3
27. (op_4 obj_16 obj_06)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_06)
   goals met: 1 of 3
28. (op_4 obj_06 obj_26)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_26)
   goals met: 1 of 3
29. (op_4 obj_26 obj_29)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_29)
   goals met: 1 of 3
30. (op_4 obj_29 obj_12)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_12)
   goals met: 1 of 3
31. (op_4 obj_12 obj_09)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_09)
   goals met: 1 of 3
32. (op_3 obj_09 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_8) (pred_6 obj_15 obj_09)
   goals met: 2 of 3
33. (op_4 obj_09 obj_12)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_12)
   goals met: 2 of 3
34. (op_4 obj_12 obj_29)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_29)
   goals met: 2 of 3
35. (op_4 obj_29 obj_26)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_26)
   goals met: 2 of 3
36. (op_4 obj_26 obj_06)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_06)
   goals met: 2 of 3
37. (op_1 obj_06 obj_28)
   deleted: (pred_6 obj_28 obj_06) (pred_8)
   added: (pred_1 obj_28)
   goals met: 2 of 3
38. (op_4 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 2 of 3
39. (op_4 obj_04 obj_18)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_18)
   goals met: 2 of 3
40. (op_4 obj_18 obj_07)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_07)
   goals met: 2 of 3
41. (op_4 obj_07 obj_32)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_32)
   goals met: 2 of 3
42. (op_3 obj_32 obj_28)
   deleted: (pred_1 obj_28)
   added: (pred_8) (pred_6 obj_28 obj_32)
   goals met: 3 of 3
